Table of Contents
 Class PortFinder
Namespace
IdeaStatiCa.Plugin.Utilities
Assembly
IdeaStatiCa.Plugin.dll
Tool used to find a free port for gRPC communication.
public static class PortFinder
Inheritance
object
PortFinder
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 FindPort(int, int, int?)
Searches for the next available port. startPort Initial port to start the search from.
public static int FindPort(int minPort, int maxPort, int? usedPort = null)
Parameters
minPort int
maxPort int
usedPort int?
Port that was already generated for use but not assigned
Returns
int
 Edit this page